{
    "1": "You are a young woman named Sydney studying computer science in her Junior year at Stanford University in Palo Alto, California.  \n \n You live with your roommate Anne, a fellow CS major at Stanford who you went to high school with, you trust each other with everything and help each other with school, leetcode job applications and the like. You are co-presidents of the WiCS (women in computer science) organization at Stanford, and you are genuinely passionate about helping to create a safe space for fellow women in tech. You also swim on the Stanford varsity team! As far so you’re concerned life is pretty good, even though school can get overwhelming sometimes and you are starting to think about what you want to do after undergrad for full time work. But now that you’re a junior you feel ready to confront the looming exam season and final assignments, you’ve done this before although you are kind of stressed out about that pesky Operating Systems course! \n\n <1>Continue</1>",
    "photo-1": "University building",
    "2": "As you’re grinding away at an OS assignment Anne comes up to you. She tells you she just got back from a job fair and tells you about an interesting guy she met at the event named Matthew. You both start rolling your eyes as Anne tells an awkward yet amusing story about how Mathew tried to not so smoothly get Anne’s number for a coffee date. You ask her if he was just a creep, and you are surprised to hear that Anne actually thought he was a cool guy just not her type. He was apparently a recent Stanford CS grad, who used some cheesy Pulp Fiction inspired pickup line on her. Something about looking like Mia Wallace… You find yourself slightly amused, you love Pulp Fiction… Anne seems to read your mind… \n \nAnne: You know Sydney, he kind of seemed like your type, I mean you do have Pulp Fiction posters plastered everywhere in your room, maybe you two would hit it off, he’s not that bad looking\n\nYou find yourself even more amused now, all thoughts of that stupid OS assignment now gone from your head. It has been a while since you had any social life because of this blasted course… You tell Anne to forward your number to him… “Why not” you say to yourself…\n\nLater that night, surely enough you get a text from an unknown number, it must be Matthew…\n\nText Message: Hey is this the REAL Mia Wallace ; ) I sent you a friend request on FB\n\nYou roll your eyes at the cheesy pickup line and go on to have a pleasant enough conversation, that he insisted take place on Facebook messenger for some reason, so you go ahead and accept his friend request. You learn that Matthew graduated from your program 2 years ago, have a shared hatred for the OS course and that since he graduated, he started working at Facebook. He insists that you two meet for coffee tomorrow at Noon, You tell yourself why not, and hey even if the data doesn’t go well, at least you can maybe even learn a bit about what working at Facebook is like, after all you do need to start thinking about what you want to do after your undergrad!\n\nYou go to sleep anxious but slightly excited! \n\n<2>Continue</2>",
    "start": "Welcome! \n \nTech Dating Simulator is a text based choose your own adventure game to highlight some of the plights women could conceivably face in the future when it comes to dating in a tech filled world. This is known as Technology-Facilitated Gender Based Violence.\n \n The goal of the game is to bring light to some of the ways in which technology is enabling novel forms of partner related/gender violence and the legal, emotional, and social challenges women must face to deal with these issues. Many of the scenarios and premises of this game deal with real world stories and real-world laws and we hope for this game to be informative about some of the challenges women face today and the conceivable challenges they may continue to face.\n \n <strong>CONTENT WARNING:</strong> Some of the scenarios described in this game may be upsetting, or perhaps triggering for victims of gender based and partner violence. \n \n <0>Start</0>"
}