{
    "1": "You are a young woman named Sydney studying computer science in her Junior year at Stanford University in Palo Alto, California.  \n \n You live with your roommate Anne, a fellow CS major at Stanford who you went to high school with, you trust each other with everything and help each other with school, leetcode job applications and the like. You are co-presidents of the WiCS (women in computer science) organization at Stanford, and you are genuinely passionate about helping to create a safe space for fellow women in tech. You also swim on the Stanford varsity team! As far so you’re concerned life is pretty good, even though school can get overwhelming sometimes and you are starting to think about what you want to do after undergrad for full time work. But now that you’re a junior you feel ready to confront the looming exam season and final assignments, you’ve done this before although you are kind of stressed out about that pesky Operating Systems course! \n\n <0>Continue</0>",
    "photo-1": "University building",
    "2": "As you’re grinding away at an OS assignment Anne comes up to you. She tells you she just got back from a job fair and tells you about an interesting guy she met at the event named Matthew. You both start rolling your eyes as Anne tells an awkward yet amusing story about how Mathew tried to not so smoothly get Anne’s number for a coffee date. You ask her if he was just a creep, and you are surprised to hear that Anne actually thought he was a cool guy just not her type. He was apparently a recent Stanford CS grad, who used some cheesy Pulp Fiction inspired pickup line on her. Something about looking like Mia Wallace… You find yourself slightly amused, you love Pulp Fiction… Anne seems to read your mind… \n \nAnne: You know Sydney, he kind of seemed like your type, I mean you do have Pulp Fiction posters plastered everywhere in your room, maybe you two would hit it off, he’s not that bad looking\n\nYou find yourself even more amused now, all thoughts of that stupid OS assignment now gone from your head. It has been a while since you had any social life because of this blasted course… You tell Anne to forward your number to him… “Why not” you say to yourself…\n\nLater that night, surely enough you get a text from an unknown number, it must be Matthew…\n\nText Message: Hey is this the REAL Mia Wallace ; ) I sent you a friend request on FB\n\nYou roll your eyes at the cheesy pickup line and go on to have a pleasant enough conversation, that he insisted take place on Facebook messenger for some reason, so you go ahead and accept his friend request. You learn that Matthew graduated from your program 2 years ago, have a shared hatred for the OS course and that since he graduated, he started working at Facebook. He insists that you two meet for coffee tomorrow at Noon, You tell yourself why not, and hey even if the data doesn’t go well, at least you can maybe even learn a bit about what working at Facebook is like, after all you do need to start thinking about what you want to do after your undergrad!\n\nYou go to sleep anxious but slightly excited! \n\n<0>Continue</0>",
    "3": "You show up at the coffee place at noon and surely enough you see what appears to be Matthew sitting at one of the tables. The place is mostly empty. You already feel nervous as you approach his table, but do your best to put on a warm smile, and try your best to remember that this is just a casual date.\n\nAfter exchanging warm smiles and greetings and ordering your coffees you begin to exchange the usual pleasantries. The topic of life as a CS student comes up first and you bond over adjusting to university life in first year and of course, how tricky OS programming can be. He talks about life as a Facebook new grad engineer, and you feel bad for asking him so many questions about the work-life balance, the culture, the pay, the interview process and the benefits, as you’re worried you may be coming off as too pushy, but Matthew happily answers, and even goes on to give some heartfelt advice about how it all comes down to what you’re looking for out of a career. You slowly easy up, Matthew seems like a pretty nice guy!\n\nThe topic somehow steers to your favorite movies…\n\nMatthew: So I know you love Pulp Fiction, I always thought that movie to be such a classic, but I always thought it overshadowed other great films that are worth mentioning, I mean Reservoir Dogs is such a classic don’t you think?\n\nYou immediately beam, you love that movie!\n\nSydney: Oh my gosh yes, to be honest I love all of Quentin Tarantino’s movies!\n\nMatthew: I bet youre one of those people that just looooooves the Kill Bill movies too eh?\n\nYou immediately smile and think to yourself how he knew out of all the Tarantino movies other than Pulp Fiction he knew that you went crazy over the Kill Bill movies. “Wow he’s good at reading me” you think to yourself slightly flustered. You continue to talk movies when the conversation eventually runs dry, and you find yourself hearing your own heartbeat… You have reached the inevitable awkward silence after you silently sip on your coffees for a minute or two, you can feel the awkwardness hang in the air. \n\n<1>What will he say next?</1>",
    "3-1":"Matthew: So you wanna tell me why you like why you like Corgi’s so much Sydney?\n\nYou’re taken aback by not only the cheekiness of his tone, but how in the world he knows you would absolutely die for corgis, you somehow all the sudden feel the urge to almost defend yourself. You respond half defensively and sarcastically to defuse your uneasiness\n\nSydney: Whoa there Matthew, I'll have you know that Corgis are objectively the best dog breed you probably aren’t even a dog person!\n\nMatthew: Are you crazy? I love dogs… \n\nMatthew goes on a long tangent about how dogs make great companions and how during rough patches in his undergrad, he almost wishes he had a dog there with him sometimes to pull him through exam season, or to give him a good excuse to go out for a walk to think through a tough bug he would be stuck on for an assignment, you find yourself at ease again, you painfully relate. In fact you think to yourself that his reasons for wanting a dog is almost the same as yours and laugh at yourself at the absurdity of the situation. \n\nThe date goes on for another 30 minutes and you talk about family, friends and the clubs you both participate in and you find yourself feeling as if you’re talking to an old friend and you have both known each other for quite a while. As the waiter comes to collect your empty coffee cups, he asks the question if you would like to split the bill or pay separately. You…\n\n<0>Stay quiet and let Matthew Decide</0><0>Speak up and say “separate”, you think it’s rude to make Matthew pay on the first date</0>",
    "3-selected-a": "\n\nYou stay quiet and leave it up to Matthew, and Matthew insists he pay for the bill. You get up and share an awkward hug (which he initiates) and you head home.\n\n<0>Continue</0>",
    "3-selected-b": "\n\nYou speak up and say “separate”. Matthew tries to insist that he can pay for the coffee but you are firm. You don’t want to create any weird expectations, afterall it was just a first date, you both pay and go your separate ways.\n\n<0>Continue</0>",
    "4": "On the bus ride home from the date you reflect. You had a genuinely goodtime, but you have this same nagging feeling you often do after first dates, he was a nice guy and all, you just couldn’t “see it”. You find yourself seeing you two being good friends in the future who hang out time to time, but not really boyfriend-girlfriend. Anyhow, you’re glad you got to meet him, he was a cool guy.\n\nLater that night, as you’re grinding away on that OS assignment you get a text from Matthew\n\nText Message: Hey Sydney! It’s Matthew, I had a really great time meeting you today, I was wondering maybe we could hit up the Facebook campus together sometime? I know some really good restaurants in the area, not to mention the Facebook free food!\n\nYou find yourself mildly annoyed… You’re stuck on this assignment, its finals season and clearly Matthew wants to move things along and you’re not sure how to tell him… you don’t want to hurt his feelings. Frustrated, but too exhausted to go through the potential social confrontation you decide to just play it off for now… You respond to his text\n\nText Message: hey Matthew, I’m pretty busy this week as you know with exams and OS lol,  ill message you some other time when I’m more free\n\nYou feel bad about not being honest with him, but you just don’t want to deal with any sort of confrontation right now, you have an assignment due tomorrow morning at 11AM, so you get to work on that. \n\nThe next morning to your dismay you get another message from Matthew this time on FB messenger, \n\nMatthew: Hey Sydney just checking in… Did you get that OS assignment finished? Maybe we can hop on a call and we can do a little pair programming xD\n\nYou are slightly taken aback, you aren’t done the assignment yet but just want to continue to focus and get it done and honestly just want to spend some time with your friends later this evening afterwards, and you get the sense this is just Matthew’s way of saying he wants to  hang out tonight when you’ve already said you’re busy. You wonder if you should just be honest but again you’re exhausted and just want to defuse the situation, you lie and tell him you already have plans for the rest of the day.\n\nTwo days later out of the blue as you’re having lunch with some friends you get another text from Matthew, and you feel you’re stomach slightly drop, its him again asking if you’re free this weekend. You decide to finally be honest about your feelings, so things don’t keep lingering on like this… You gingerly write out a message to him and after reading it over a couple times decide to hit send…\n\nText Message: Hey Matthew! I really appreciate that you want to hang out a lot, I had a lot of fun meeting you too, I just want to be honest with you, I think you’re a really great guy and would genuinely love to be friends, I just don’t see us being together romantically is all, maybe we can hangout sometime after my exams!\n\nYou feel a bit bad, but mostly relieved now that you finally let him know, and you go back to eating lunch with your friends. Only about 30 seconds later to your surprise you see your phone light up instantly. It’s a text from Matthew. Your heart skips a beat, and you immediately know that’s probably not a good sign. You reluctantly open the message\n\nText Message: What the? I did everything right? I even knew about your interests, I mean all we did was talk about you and even offered to show you around the Facebook campus what else do you want? You women think you’re so righteous with all your feminist talk but then a guy actually does everything by the book and still gets nothing in return!?!?!!?\n\nYou cant help but just stare at your phone as your stomach churns with disbelief. The screen of your phone almost appears to be swirling and the ambient noise around you seems to be dimmed out all the sudden. No guy has ever ever been this way with you before after politely turning them down and you almost can’t believe what you’re reading.  You clearly look distraught, and Anne asks what’s wrong. You feel vulnerable, and don’t want to dim the mood with your friends and just tell her its nothing, you put your phone away, but your appetite is ruined, and you spend the rest of the lunch relatively quiet. \n\nAs you finish lunch with your friends and head back home your phone feels like it weighs a million pounds in your pocket. As you sit on your bed, you feel a weird mix of anger, shame, disbelief and even a tiny bit of fear. Guys can do scary things when they react like this… you decide that you need to do something but at the same time you feel defeated, what could possibly fix this? Maybe it will just go away… You decide to \n\n<2>Ignore/Ghost him, you’ll probably never see him again anyway</2>\n\n<3>Say something mean/stern back, you need to standup for yourself.</3>",
    "4-selected-a": "\n\nI hope he'll just leave me alone \n\n<0>Continue</0>",
    "4-selected-b": "\n\nWho does this person think he is?\n\n<0>Continue</0>",
    "5a": "You finally conclude that you should let this just slowly drift into a bad memory and decide the best course of action is to just not respond. You just hope that he doesn’t try to contact you again and just moves on as well. You put your phone down on your bedside facedown and for the rest of the day you almost treat it as a ticking time bomb, not wanting to check it for fear that Matthew might be berating you. You try to unwind by watching some Netflix, but you still just feel uneasy, and your gut tells you that something is just wrong. \n\nAs you get ready for bed, your anxiousness gives in, and you need to check if you set your alarm anyways, afterall you still have swimming practice tomorrow. You slowly check your phone, and your heart expands as you let out a sigh of relief. You have a lot of messages and none of them seem to be from Matthew, just various group chats and email. You scroll through them, and your heart immediately hardens. You have a single messenger notification \n\nMatthew has sent you a photo\n\nYour mind already begins to race through all the horrible things this photo could be… You think to yourself if this is even worth opening… Maybe its just something stupid, he just had to let some anger out one last time and that’s the last you’ll ever hear from him. You decide its just not worth looking at whatever the hell that photo might be, and you decide to just call it a day and go to sleep, after all you have swimming tomorrow, although you no longer feel like going. \n\nAfter a few hours of tossing and turning in bed, you finally fall asleep\n\n<1>The next morning</1>",
    "5a-1": "You wake up very very tired, you slept terribly, as the Matthew ordeal is still on your mind. You gingerly check your phone and youre surprised to see a mountain of notifications, not from Matthew, but from the WiCS and swimming group chats, your friends group chats, and a whole bunch of messages from Anne. “What in the world is going on?”. Anne comes into your room without knocking… she looks like a doctor telling a patient it’s terminal. This cant be good. Anne speaks to you softly as if any louder and her voice would would shatter every piece of glass in the apartment building…\n\nAnne: Sydney, have you seen my messages?…\n\nYour mind is starting to go blank as you grab your phone to check Anne’s messages, she has also sent you a photo. You open Facebook messenger and are greeted by something you would have never thought you’d see in your life. It’s a picture of yourself from last Halloween that you sent Anne on Facebook messenger but… youre not wearing your costume, you see a naked body, not your naked body for sure, but just a highly realistic looking naked body, with your head on top of it, it’s a deep fake.\n\nYour heart starts beating very fast and you almost can’t avert your gaze from your phone, it feels like an eternity passes. Did Matthew do this? How did he even get the photo? You feel incredibly violated… The image looks convincing, and you can feel tears welling in your eyes. It feels like the world around you is swirling and time is slowing… Anne is saying your name, but it doesn’t register… You defeatedly look at all the other group chats your phone has blown up with. The image is everywhere, in the WiCS group chat, your swimming friends are talking about it and the photo has been posted to the Stanford Class of 2023 group chat even… You even have a text from your mother, frantically asking why in the world you would post a risqué photo like that online, and finally you even got another message from Matthew, in addition to another copy of the sexually explicit image… It reads\n\nText Message: You regret being a b*tch?\n\nYou decide to…\n\n<4>Ignore it all and do nothing, your life is over anyways now that this image is out.</4>\n\n<5>Try explaining to everyone that this image just isn’t real and some crazy guy is trying to ruin your life.</5>\n\n<6>Take legal action, this must be illegal somehow…</6>",
    "start": "Welcome! \n \nTech Dating Simulator is a text based choose your own adventure game to highlight some of the plights women could conceivably face in the future when it comes to dating in a tech filled world. This is known as Technology-Facilitated Gender Based Violence.\n \n The goal of the game is to bring light to some of the ways in which technology is enabling novel forms of partner related/gender violence and the legal, emotional, and social challenges women must face to deal with these issues. Many of the scenarios and premises of this game deal with real world stories and real-world laws and we hope for this game to be informative about some of the challenges women face today and the conceivable challenges they may continue to face.\n \n <strong>CONTENT WARNING:</strong> Some of the scenarios described in this game may be upsetting, or perhaps triggering for victims of gender based and partner violence. \n \n <0>Start</0>"
}