{
    "1": "You are a young woman named Sydney studying computer science in her Junior year at Stanford University in Palo Alto, California.  \n \n You live with your roommate Anne, a fellow CS major at Stanford who you went to high school with, you trust each other with everything and help each other with school, leetcode job applications and the like. You are co-presidents of the WiCS (women in computer science) organization at Stanford, and you are genuinely passionate about helping to create a safe space for fellow women in tech. You also swim on the Stanford varsity team! As far so you’re concerned life is pretty good, even though school can get overwhelming sometimes and you are starting to think about what you want to do after undergrad for full time work. But now that you’re a junior you feel ready to confront the looming exam season and final assignments, you’ve done this before although you are kind of stressed out about that pesky Operating Systems course! \n\n <0>Continue</0>",
    "photo-1": "University building",
    "2": "As you’re grinding away at an OS assignment Anne comes up to you. She tells you she just got back from a job fair and tells you about an interesting guy she met at the event named Matthew. You both start rolling your eyes as Anne tells an awkward yet amusing story about how Mathew tried to not so smoothly get Anne’s number for a coffee date. You ask her if he was just a creep, and you are surprised to hear that Anne actually thought he was a cool guy just not her type. He was apparently a recent Stanford CS grad, who used some cheesy Pulp Fiction inspired pickup line on her. Something about looking like Mia Wallace… You find yourself slightly amused, you love Pulp Fiction… Anne seems to read your mind… \n \nAnne: You know Sydney, he kind of seemed like your type, I mean you do have Pulp Fiction posters plastered everywhere in your room, maybe you two would hit it off, he’s not that bad looking\n\nYou find yourself even more amused now, all thoughts of that stupid OS assignment now gone from your head. It has been a while since you had any social life because of this blasted course… You tell Anne to forward your number to him… “Why not” you say to yourself…\n\nLater that night, surely enough you get a text from an unknown number, it must be Matthew…\n\nText Message: Hey is this the REAL Mia Wallace ; ) I sent you a friend request on FB\n\nYou roll your eyes at the cheesy pickup line and go on to have a pleasant enough conversation, that he insisted take place on Facebook messenger for some reason, so you go ahead and accept his friend request. You learn that Matthew graduated from your program 2 years ago, have a shared hatred for the OS course and that since he graduated, he started working at Facebook. He insists that you two meet for coffee tomorrow at Noon, You tell yourself why not, and hey even if the data doesn’t go well, at least you can maybe even learn a bit about what working at Facebook is like, after all you do need to start thinking about what you want to do after your undergrad!\n\nYou go to sleep anxious but slightly excited! \n\n<0>Continue</0>",
    "3": "You show up at the coffee place at noon and surely enough you see what appears to be Matthew sitting at one of the tables. The place is mostly empty. You already feel nervous as you approach his table, but do your best to put on a warm smile, and try your best to remember that this is just a casual date.\n\nAfter exchanging warm smiles and greetings and ordering your coffees you begin to exchange the usual pleasantries. The topic of life as a CS student comes up first and you bond over adjusting to university life in first year and of course, how tricky OS programming can be. He talks about life as a Facebook new grad engineer, and you feel bad for asking him so many questions about the work-life balance, the culture, the pay, the interview process and the benefits, as you’re worried you may be coming off as too pushy, but Matthew happily answers, and even goes on to give some heartfelt advice about how it all comes down to what you’re looking for out of a career. You slowly easy up, Matthew seems like a pretty nice guy!\n\nThe topic somehow steers to your favorite movies…\n\nMatthew: So I know you love Pulp Fiction, I always thought that movie to be such a classic, but I always thought it overshadowed other great films that are worth mentioning, I mean Reservoir Dogs is such a classic don’t you think?\n\nYou immediately beam, you love that movie!\n\nSydney: Oh my gosh yes, to be honest I love all of Quentin Tarantino’s movies!\n\nMatthew: I bet youre one of those people that just looooooves the Kill Bill movies too eh?\n\nYou immediately smile and think to yourself how he knew out of all the Tarantino movies other than Pulp Fiction he knew that you went crazy over the Kill Bill movies. “Wow he’s good at reading me” you think to yourself slightly flustered. You continue to talk movies when the conversation eventually runs dry, and you find yourself hearing your own heartbeat… You have reached the inevitable awkward silence after you silently sip on your coffees for a minute or two, you can feel the awkwardness hang in the air. \n\n<1>What will he say next?</1>",
    "3-1":"Matthew: So you wanna tell me why you like why you like Corgi’s so much Sydney?\n\nYou’re taken aback by not only the cheekiness of his tone, but how in the world he knows you would absolutely die for corgis, you somehow all the sudden feel the urge to almost defend yourself. You respond half defensively and sarcastically to defuse your uneasiness\n\nSydney: Whoa there Matthew, I'll have you know that Corgis are objectively the best dog breed you probably aren’t even a dog person!\n\nMatthew: Are you crazy? I love dogs… \n\nMatthew goes on a long tangent about how dogs make great companions and how during rough patches in his undergrad, he almost wishes he had a dog there with him sometimes to pull him through exam season, or to give him a good excuse to go out for a walk to think through a tough bug he would be stuck on for an assignment, you find yourself at ease again, you painfully relate. In fact you think to yourself that his reasons for wanting a dog is almost the same as yours and laugh at yourself at the absurdity of the situation. \n\nThe date goes on for another 30 minutes and you talk about family, friends and the clubs you both participate in and you find yourself feeling as if you’re talking to an old friend and you have both known each other for quite a while. As the waiter comes to collect your empty coffee cups, he asks the question if you would like to split the bill or pay separately. You…\n\n<0>Stay quiet and let Matthew Decide</0><0>Speak up and say “separate”, you think it’s rude to make Matthew pay on the first date</0>",
    "3-selected-a": "\n\nYou stay quiet and leave it up to Matthew, and Matthew insists he pay for the bill. You get up and share an awkward hug (which he initiates) and you head home.\n\n<0>Continue</0>",
    "3-selected-b": "\n\nYou speak up and say “separate”. Matthew tries to insist that he can pay for the coffee but you are firm. You don’t want to create any weird expectations, afterall it was just a first date, you both pay and go your separate ways.\n\n<0>Continue</0>",
    "4": "On the bus ride home from the date you reflect. You had a genuinely goodtime, but you have this same nagging feeling you often do after first dates, he was a nice guy and all, you just couldn’t “see it”. You find yourself seeing you two being good friends in the future who hang out time to time, but not really boyfriend-girlfriend. Anyhow, you’re glad you got to meet him, he was a cool guy.\n\nLater that night, as you’re grinding away on that OS assignment you get a text from Matthew\n\nText Message: Hey Sydney! It’s Matthew, I had a really great time meeting you today, I was wondering maybe we could hit up the Facebook campus together sometime? I know some really good restaurants in the area, not to mention the Facebook free food!\n\nYou find yourself mildly annoyed… You’re stuck on this assignment, its finals season and clearly Matthew wants to move things along and you’re not sure how to tell him… you don’t want to hurt his feelings. Frustrated, but too exhausted to go through the potential social confrontation you decide to just play it off for now… You respond to his text\n\nText Message: hey Matthew, I’m pretty busy this week as you know with exams and OS lol,  ill message you some other time when I’m more free\n\nYou feel bad about not being honest with him, but you just don’t want to deal with any sort of confrontation right now, you have an assignment due tomorrow morning at 11AM, so you get to work on that. \n\nThe next morning to your dismay you get another message from Matthew this time on FB messenger, \n\nMatthew: Hey Sydney just checking in… Did you get that OS assignment finished? Maybe we can hop on a call and we can do a little pair programming xD\n\nYou are slightly taken aback, you aren’t done the assignment yet but just want to continue to focus and get it done and honestly just want to spend some time with your friends later this evening afterwards, and you get the sense this is just Matthew’s way of saying he wants to  hang out tonight when you’ve already said you’re busy. You wonder if you should just be honest but again you’re exhausted and just want to defuse the situation, you lie and tell him you already have plans for the rest of the day.\n\nTwo days later out of the blue as you’re having lunch with some friends you get another text from Matthew, and you feel you’re stomach slightly drop, its him again asking if you’re free this weekend. You decide to finally be honest about your feelings, so things don’t keep lingering on like this… You gingerly write out a message to him and after reading it over a couple times decide to hit send…\n\nText Message: Hey Matthew! I really appreciate that you want to hang out a lot, I had a lot of fun meeting you too, I just want to be honest with you, I think you’re a really great guy and would genuinely love to be friends, I just don’t see us being together romantically is all, maybe we can hangout sometime after my exams!\n\nYou feel a bit bad, but mostly relieved now that you finally let him know, and you go back to eating lunch with your friends. Only about 30 seconds later to your surprise you see your phone light up instantly. It’s a text from Matthew. Your heart skips a beat, and you immediately know that’s probably not a good sign. You reluctantly open the message\n\nText Message: What the? I did everything right? I even knew about your interests, I mean all we did was talk about you and even offered to show you around the Facebook campus what else do you want? You women think you’re so righteous with all your feminist talk but then a guy actually does everything by the book and still gets nothing in return!?!?!!?\n\nYou cant help but just stare at your phone as your stomach churns with disbelief. The screen of your phone almost appears to be swirling and the ambient noise around you seems to be dimmed out all the sudden. No guy has ever ever been this way with you before after politely turning them down and you almost can’t believe what you’re reading.  You clearly look distraught, and Anne asks what’s wrong. You feel vulnerable, and don’t want to dim the mood with your friends and just tell her its nothing, you put your phone away, but your appetite is ruined, and you spend the rest of the lunch relatively quiet. \n\nAs you finish lunch with your friends and head back home your phone feels like it weighs a million pounds in your pocket. As you sit on your bed, you feel a weird mix of anger, shame, disbelief and even a tiny bit of fear. Guys can do scary things when they react like this… you decide that you need to do something but at the same time you feel defeated, what could possibly fix this? Maybe it will just go away… You decide to \n\n<2>Ignore/Ghost him, you’ll probably never see him again anyway</2>\n\n<3>Say something mean/stern back, you need to standup for yourself.</3>",
    "4-selected-a": "\n\nI hope he'll just leave me alone \n\n<0>Continue</0>",
    "4-selected-b": "\n\nWho does this person think he is?\n\n<0>Continue</0>",
    "5a": "You finally conclude that you should let this just slowly drift into a bad memory and decide the best course of action is to just not respond. You just hope that he doesn’t try to contact you again and just moves on as well. You put your phone down on your bedside facedown and for the rest of the day you almost treat it as a ticking time bomb, not wanting to check it for fear that Matthew might be berating you. You try to unwind by watching some Netflix, but you still just feel uneasy, and your gut tells you that something is just wrong. \n\nAs you get ready for bed, your anxiousness gives in, and you need to check if you set your alarm anyways, afterall you still have swimming practice tomorrow. You slowly check your phone, and your heart expands as you let out a sigh of relief. You have a lot of messages and none of them seem to be from Matthew, just various group chats and email. You scroll through them, and your heart immediately hardens. You have a single messenger notification \n\nMatthew has sent you a photo\n\nYour mind already begins to race through all the horrible things this photo could be… You think to yourself if this is even worth opening… Maybe its just something stupid, he just had to let some anger out one last time and that’s the last you’ll ever hear from him. You decide its just not worth looking at whatever the hell that photo might be, and you decide to just call it a day and go to sleep, after all you have swimming tomorrow, although you no longer feel like going. \n\nAfter a few hours of tossing and turning in bed, you finally fall asleep\n\n<1>The next morning</1>",
    "5a-1": "You wake up very very tired, you slept terribly, as the Matthew ordeal is still on your mind. You gingerly check your phone and youre surprised to see a mountain of notifications, not from Matthew, but from the WiCS and swimming group chats, your friends group chats, and a whole bunch of messages from Anne. “What in the world is going on?”. Anne comes into your room without knocking… she looks like a doctor telling a patient it’s terminal. This cant be good. Anne speaks to you softly as if any louder and her voice would would shatter every piece of glass in the apartment building…\n\nAnne: Sydney, have you seen my messages?…\n\nYour mind is starting to go blank as you grab your phone to check Anne’s messages, she has also sent you a photo. You open Facebook messenger and are greeted by something you would have never thought you’d see in your life. It’s a picture of yourself from last Halloween that you sent Anne on Facebook messenger but… youre not wearing your costume, you see a naked body, not your naked body for sure, but just a highly realistic looking naked body, with your head on top of it, it’s a deep fake.\n\nYour heart starts beating very fast and you almost can’t avert your gaze from your phone, it feels like an eternity passes. Did Matthew do this? How did he even get the photo? You feel incredibly violated… The image looks convincing, and you can feel tears welling in your eyes. It feels like the world around you is swirling and time is slowing… Anne is saying your name, but it doesn’t register… You defeatedly look at all the other group chats your phone has blown up with. The image is everywhere, in the WiCS group chat, your swimming friends are talking about it and the photo has been posted to the Stanford Class of 2023 group chat even… You even have a text from your mother, frantically asking why in the world you would post a risqué photo like that online, and finally you even got another message from Matthew, in addition to another copy of the sexually explicit image… It reads\n\nText Message: You regret being a b*tch?\n\nYou decide to…\n\n<4>Ignore it all and do nothing, your life is over anyways now that this image is out.</4>\n\n<5>Try explaining to everyone that this image just isn’t real and some crazy guy is trying to ruin your life.</5>\n\n<6>Take legal action, this must be illegal somehow…</6>",
    "5b": "After thinking it over you decide to be stern with him, you can't just let someone treat you like this, so you write up a message to send Matthew on Facebook messenger \n\nText message: Matthew, are you serious? Is this how you treat women when they politely decline your advances? I genuinely wanted to be your friend… people like you are so entitled, tbh surprised you’re working at a company like Facebook, people like you don’t deserve to be working at a place like that, please never talk to me again, I can't stand people like you honestly who just are so aggressive and constantly throwing tantrums when you don’t get your way. I hope I never have to see or talk to people like you again\n\nYou send off the message and just hope that he doesn’t try to contact you again and just moves on as well. You put your phone down on your bedside facedown and for the rest of the day you almost treat it as a ticking time bomb, not wanting to check it for fear that Matthew might be berating you. You try to unwind by watching some Netflix, but you still just feel uneasy, and your gut tells you that something is just wrong. \n\nAs you get ready for bed, your anxiousness gives in, and you need to check if you set your alarm anyways, afterall you still have swimming practice tomorrow. You slowly check your phone, and your heart expands as you let out a sigh of relief. You have a lot of messages and none of them seem to be from Matthew, just various group chats and email. You scroll through them, and your heart immediately hardens. You have a single messenger notification \n\nMatthew has sent you a message\n\nYour mind already begins to race through all the horrible things this message could be… You think to yourself if this is even worth opening… Maybe its just something stupid, he just had to let some anger out one last time and that’s the last youll ever hear from him. You decide its just not worth looking at whatever the hell that message might be, and you decide to just call it a day and go to sleep, after all you have swimming tomorrow, although you no longer feel like going. \n\nAfter a few hours of tossing and turning in bed, you finally fall asleep<1>The next morning</1>",
    "5b-1": "The next morning, you wake up very very tired, you slept terribly, as the Matthew ordeal is still on your mind. You gingerly check your phone and youre surprised to see a mountain of notifications, not from Matthew, but from the WiCS and swimming group chats, your friends group chats, and a whole bunch of messages from Anne. “What in the world is going on?”. Anne comes into your room without knocking which is unusual for her and she has the look on her face that a doctor has when they’re about to inform their patient they have terminal cancer. This cant be good. Anne speaks to you softly as if any louder and her voice would shatter every piece of glass in the apartment building…\n\nAnne: Sydney, you might want to check my messages and the group chat…\n\nYour mind is starting to go blank as you grab your phone to check Anne’s messages, she has sent you a screenshot of a message it appears you sent. You open Facebook messenger and are greeted by something you would have never thought you’d see in your life. It’s a screenshot of a message that appears to be written by you. Surely enough to the left of the message is your Facebook profile picture and above it your name the message reads\n\n“Black people like you are so entitled, tbh surprised you’re working at a company like Facebook, people like you don’t deserve to be working at a place like that, please never talk to me again, I cant stand people like you honestly who just are so aggressive and constantly throwing tantrums when you don’t get your way. I hope I never have to see or talk to people like you again”\n\n1You stare at the message in disbelief. You have never said anything racist like that in your life, Matthew must have photoshopped the message you sent yesterday.  You check your phone and to your complete shock and awe this very message has been sent, from your account to Rachel’s, one of your black friends from WiCS who recently got an internship at Facebook. Sure enough Rachel has already blocked you on Facebook, and you can't help but stare at the chat logs between you now. How did this message get sent, you never sent it… Matthew must have hacked your Facebook somehow or something. To your horror, the WiCS group chat is blowing up with screenshots of the message with people expressing disbelief that you could say something like this as president of the WiCS club and demanding a public apology to Rachel, and that you step down as president of WiCS immediately. People want you out of the club now and numerous people have already blocked you on Twitter, Instagram and Facebook. Your hands begin to shake while Anne stands in your doorway similarly shocked. \n\nYou get another message from Matthew on Facebook. He sent you a screenshot of this damning racist and forged message last night and this new text reads\n\nText Message: You regret your decision yet b*tch?\n\nYou decide to…\n\n<4>Ignore it all and do nothing, your life is over anyways now that this image is out.</4>\n\n<5>Try explaining to everyone that this image just isn’t real and some crazy guy is trying to ruin your life.</5>\n\n<6>Take legal action, this must be illegal somehow…</6>",
    "6a1": "You decide that there is nothing you can do, and you begin to break down and cry. You want to throw up at the thought of confronting everyone, WiCS, your parents… and you dont even want to think about how you can stop this photo from spreading. You feel helpless. You keep on asking yourself how in the world Mathhew had gotten this photo. You sent it to Anne… Only Anne… via a private message on Facebook. Anne is still standing in the hallway, and she begins to approach you to comfort you but you shove her away, you just want to be alone, and to retreat into your bed, away from the world. As you push Anne out and slam your door shut, you still see your phone lighting up with messages. Tags on twitter, Instagram, Facebook groupchats every notification a reminder that this image of you, this fake yet realistic looking pornographic image of you is spreading through chatrooms. As you lay in bed crying all you can tell yourself is that your life at Stanford is over, you need to get out of here, there’s no way you can stay here anymore… You can transfer to another school and just start anew…\n\n<1>One Year Later</1>",
    "6a1-1": "You are now a senior CS student at UC berkeley and have only just begun adjusting to your new life… You miss Anne, your swimming teammates and Stanford, but there is just too much baggage in the past and you want to start anew. You are seeing a therapist, you’ve developed OCD and anxiety over the past year, as you have trouble not obsessively checking the internet to see where that dreaded photo has spread to next. People still look at you funny in public sometimes, and despite all the new social media accounts you've made, you still get harassed online over that picture. You miss being involved in student activities, but can't bring yourself to socialize all that much anymore… You are more distant from your parents… They have not been supportive and they frequently bring up how you could have posted such an image on the internet, and how it makes you a bad person… You have a lot of trouble speaking with other men online, for fear the same thing could happen again…\n\n<strong>Epilogue</strong>\n\nLife is going good for Matthew, as he is now a senior executive of security and trust at Facebook. Matthew continues to abuse his access to internal data at Facebook to get detailed information about a woman’s personality and interests so he can charm them on first dates, and uses this data to harass and stalk them if they don't pursue the relationship further…  Indeed, Matthew used his data access rights to access photos Sydney has sent others and used it to create the deepfake nude image…",
    "6a2": "You decide that you have to turn to your friends and family for support. Maybe if they understood the situation they could help you get out of this mess. \n\nYou begin explaining to Anne the whole ordeal, how your date with Matthew was alright, you didn't feel much and he responded nastily so you just decided to not respond. You show Anne the horrible text he sent you… Anne’s face looks very distraught, and she comforts you as your hands begin to shake and your voice trembles as you get near the end of the story. Anne assures you that she knows the image is fake and that she believes everything. You feel a bit better, but still what could you possibly do? The image is surely everywhere by now… Anne assures you that she will back you up, and that you should simply be honest with everyone about what happened. She assures you that people will believe you, you have the nasty message from Matthew to support your case after all. You decide the best course of action is to write some sort of statement, explaining the situation with screenshots of Matthew’s nasty message and send it to everyone, your parents, the WiCS group, the swimming team, and maybe post it to social media. \n\nSo you take some time to write a nice statement. It’s almost painful to recollect all this and you can't help feeling some shame and self guilt. You should have never gone on that date, you should have maybe responded to him, hell maybe even gone on a second date. Anne assures you it's outrageous for you to be blaming yourself and none of this is your fault… You still can't shake the feeling that it somehow is though. \n\nAfter re-reading your statement over and over and over again, and appealing for the support of your closest friends and family, you decide to finally release the statement. As you hit post and send across multiple mediums you can bear to look at your phone or computer anymore, you just need to sleep… You go to sleep feeling incredibly worn out, and you can't get the deep fake image out of your head.\n\nThe next morning, you gingerly check your phone social media for the response… To your surprise almost all your friends and family are supportive and in shock that this happened, and you feel some of the tension that has soaked your whole body for the past 24 hours finally dissipate… Your heart sinks at the one or two comments from anonymous accounts that give you every misogynistic slur in the book, exclaiming that you’re just another woman who’s been exposed and now crying about it, and to your dismay one of them even reposted the image in the comments, and you begin to cry… Anne assures you to just block them, and that you’ll get through this, most people believe you… but that image is still out there… and you can't help but feel that image is going to be out there forever\n\n<1>One Year Later</1>",
    "6a2-1": "You are now a senior at Stanford and decided not to run again for president of WiCS again and you have stopped swimming. You have grown to become really anxious whenever a guy asks you out on a date and you see a therapist once a week for the panic attacks you have sometimes when you surf the web and see mentions of the whole incident, and although no one really talks about the image anymore, it comes up every now and then from anonymous people online and you have no idea how to take it down. Seeing the image re-opens old wounds you thought have healed and gone away. While most of your friends and family have been supportive and there for you and encourage you to get involved again, you find your mood is very unstable and you are very depressed some days and it even gets in the way of school sometimes. “Maybe swimming again will take your mind off the incident” they say… You appreciate their support, but deep down even a year later, you find yourself just stuck in a thought pattern thinking about the incident, and regretting ever going on a date with Matthew and you still wonder how he ever got a photo that you sent to Anne privately? Maybe she sent it to other people? You have no way of knowing…\n\n <strong>Epilogue</strong>\n\nMatthew is still an engineer at Facebook. He continues to abuse his data access rights to stalk and learn about the women he goes on dates with, and uses it to harass the women if they don't agree to a second date. Surely enough, Matthew was able to use his access rights to find that image Sydney sent Anne in a private Facebook message chat and was able to use that image to create a deepfake using tools online… He knows that if he gets caught he will be fired and was surprised to see that Sydney didn't accuse him publicly of anything, so he decides to reel back on abusing his data access rights for the time being… Maybe he’ll give it a couple of months before he tries it again…",
    "6a3": "You feel increasing anger and shame and decide that what just happened to you must be illegal. You’re not a lawyer and you’re not sure what law is exactly being broken here but it just has to be violating some law, otherwise you have lost all faith in this country. You yell at Anne to get out and decide to do some internet lawyer investigative work. You quickly find yourself unable to even accurately articulate or put a name to what sort of crime this could be. Was this sexual assault? Were your intellectual property rights being violated because you owned that original photo? Does this count as sexual harrassment? Bullying? Defamation? Is there a deepfake law? Does it matter if the photo was real or fake or not? You Google revenge porn and to your horror you see that countless other women have gone through the same thing and even worse, you see that almost all women have had trouble taking the images down, or in taking any legal action at all. You try reading some articles and some penal codes, but they are nonsensical. You start to become overwhelmed… You have never dealt with the legal system before. How could you afford a lawyer? Who do you even go to? You feel defeated and almost feel like giving up…You tell Anne about how hard it is to find legal advice, and she advises you that the least you can do is maybe go to the police station… You decide to\n\n<2>Agree. Maybe the police have resources for you, or special investigative units that can help you bring Matthew to justice</2><3>Disagree. What can a police officer do? You should see a lawyer instead, they’d probably know what to do.</3>",
    "6a3-selected-a": "\n\n<0>Take it to the police</0>",
    "6a3-selected-b": "\n\n<0>Get a lawyer</0>",
    "7a3a": "You think to yourself Anne is probably right, the police should be able to help you. So you two set off to the police station to see if anything was to be done. To your dismay the conversation between you and an officer could not have gone worse. The officer did not even know what a deep fake was… And to make matters worse he had the audacity to suggest that you are to blame. “You ought to be careful about what you post online,” he said. You wouldn't believe your ears and feel flashes of anger course through you. You plead that you feel sexually harassed… that this was non-consensual… Surely that must be against the law… The officer asked\n\nPolice Officer: Ma’am do you have this person's information at least so we can go question him… Can you prove to us that this was non-consensual? We need something substantive here instead of this “he said she said”. If you don't have his contact information at least there’s nothing I can do for you.\n\nYou begin to feel an incredible sense of injustice. Why does it seem like the burden is on you, you’re the victim here!? You scramble for your phone, at least you can give them his phone number… \n\nPolice Officer: We will see what we can do ma’am and will be in touch thank you for bringing this to our attention.\n\nYou head home with Anne almost in tears. You are frustrated at the fact that the police officer doesnt even seem to know what online sexual harrassment is, and what deepfakes even are. You think to yourself how backwards it is that some officers still seem to think sexual harrasment is a merely physical thing in this digital age… \n\nA couple of days later the police contact you, and they ask for Matthew’s social media accounts to further the investigation. You happily google his Facebook profile, but his profile isn’t showing up. Confused, you scroll through your long list of Facebook friends, and can't find his profile. You open up Facebook messenger and sure enough, not a trace of those nasty conversations can be found let alone the sexually explicit image of yourself that he sent you on Facebook.  Your heart begins to sink… he must have deleted his social media accounts… You defeatedly email the officers, saying you no longer have access to the social media accounts or the chat logs! You start to berate yourself for not saving screenshots of them as you begin to feel your chest tighten. You have a horrible feeling that Matthew is going to get away with this. The next day you get an email from the police\n\nEMAIL: \n\nTo whom it may concern,\n\nWe’re very sorry Sydney, but there is not much we can do for your revenge porn case. Without any way of proving that it was he who disseminated the photos online, unfortunately there is not much more we can do. We advise that you be careful about who you send sexual explicit photos to. \n\nAs the meaning of the email begins to settle on you, you feel a storm of anger, sadness, shame and guilt. You should have never gone on a date with him, this is all Anne’s fault. Your reputation is destroyed, the image is going to circulate online forever, and you can't stand the thought of facing your peers anymore. This was all your fault. You wish you could go back in time and choose differently, but you have no will to fight this anymore. No will to face your peers and you just lay in bed defeated… You feel like your body is not yours anymore, that you don't have control over it and you begin to cry at the injustice of it all. You can’t help but feel countless other women have gone through the exact same thing.\n\n<strong>Epilogue</strong>\n\nMatthew is still an engineer at Facebook. He continues to abuse his data access rights to stalk and learn about the women he goes on dates with, and uses it to harass the women if they don't agree to a second date. Surely enough, Matthew was able to use his access rights to find that image Sydney sent Anne in a private Facebook message chat and was able to use that image to create a deepfake using tools online… He knows that if he gets caught he will be fired and was spooked after being contacted by the police. Thankfully, using his data access rights, he erased all correspondence between him and Sydney on Facebook by the time Sydney wanted to hand them over to the police, so they have no way to prove it was him spreading the photo. All they had was a few nasty exchanges over text messages. No biggie. Matthew decides to lay back on his data abuses for now, as being contacted by the police was a bit of a sobering reality check… Yet he plans to continue in the not so distant future.",
    "7a3b": "You disagree with Anne, and feel that contacting a lawyer is better. A lawyer probably would better understand the complexities and novelties that online sexual harrassment is, and it’s highly likely the average officer would not know how to deal with a case like this. You do some more research online and find that, thanks to God’s good graces, California state law has explicit laws dealing with deep fakes and revenge porn. You try to parse the law, entitled Penal Code 647j4 states \n\n“A person who intentionally distributes the image of the intimate body part or parts of another identifiable person, or an image of the person depicted engaged in an act of sexual intercourse, sodomy, oral copulation, sexual penetration, or an image of masturbation by the person depicted or in which the person depicted participates, under circumstances in which the persons agree or understand that the image shall remain private, the person distributing the image knows or should know that distribution of the image will cause serious emotional distress, and the person depicted suffers that distress.“\n\nYou begin to feel confident, surely you have a case here. It was your intent that photo you sent to Anne on halloween was meant to be private, afterall the only place it existed was on your phone and in your private DM’s with her on Facebook. You quickly screenshot the message of Matthew calling you a b*tch and the nasty messages he sent earlier to establish that he knew distributing such an image would cause emotional distress. You’re not sure if this is enough though, afterall you’re not a lawyer. \n\nFeeling at least a little more confident now, you Google some seemingly reputable criminal law lawyers in your area, and to your surprise Stanford offers legal aid to some of its students. You call one of the lawyers up and his name is Mark and he offers you an hour initial consultation, and you explain to him your understanding of the California deepfake revenge porn law and the relevant evidence you think you have. Mark agrees that you do have a case here, and if convicted Matthew could be charged with a misdemeanor and faces up to six months in jail or a $1000 dollar fine if charged. \n\n<1>Eight Months Later</1>",
    "7a3b-1": "It has taken 8 whole months for your case to go to trial, and the process has been exhausting. You have had to spend countless hours talking to your lawyer about the particulars of the case, and have had to endure hours of conversation with Mark involving legalese that goes over your head. The whole process has been long, exhausting, expensive and has certainly taken a toll on your academic performance. This case feels like an extra weight on your shoulders for the past 8 months and your friends frequently remind you that you’re just not the same. Thankfully most, but not all of your peers have been supportive otherwise, and you just want the case to be decided so you can get some closure about the whole incident. You have stepped down from your position as co-president of WiCS and you don't swim anymore. You still get weird looks around campus these days, and worse of all, you still see the image resurface on the internet. Mostly from anonymous accounts, and while you report them and take them down, knowing that those fake images still float around is very upsetting. Your lawyer tells you that there is not much they can do about the photos online, and while they can have them taken down, there is almost no way to stop them from circulating at least a little bit…\n\n<strong>Epilogue</strong>\n\nIn the end, Matthew is found guilty under the revenge porn law in California, and was fired from his job at Facebook. The judge rules that there are aggravating factors, considering Matthew abused his privileges at Facebook to find the private image that Sydney had sent Anne via private DM on Facebook that was eventually used to create the deepfake. During the discovery phase of the trial, it was discovered that Matthew had used his internal data access rights at Facebook to retrieve the image that Sydney had sent Anne privately so he could use it to create the deepfake, and as a result was sentenced more than the minimum 6 months, and was given 1 year in county jail instead. Sydney continues her studies at Stanford, and her family and friends have some closure knowing that Matthew was brought to justice. Sydney is still frustrated though, she was told by her lawyer that they were lucky that this happened in the state of California, as other states criminal codes have not caught up with this new form of digital sexual harrassment. This fact made Sydney very upset. Nevertheless she continues on to her senior year, the whole ordeal starting to fade into a distant bad dream. She considers herself lucky she had the legal aid and that she lived in California… She wonders how other women, who were not as privileged as her to receive legal aid from Stanford, and had a state with out of date criminal law, could have possibly dealt with something like this… and feels inspired to raise awareness about this.",
    "6b1": "You decide that there is nothing you can do, and you begin to break down and cry. You want to throw up at the thought of confronting everyone, WiCS, your parents… and you don't even want to think about how you can stop this screenshot from spreading, it’s already out there, and you know that nothing can ever be permanently erased from the internet. You feel helpless. You keep on asking yourself how in the world Mathhew had created this message and made it look real in the Messenger app. Anne is still standing in the hallway, and she begins to approach you to comfort you but you shove her away, you just want to be alone, and to retreat into your bed, away from the world. As you push Anne out and slam your door shut, you still see your phone lighting up with messages. Tags on twitter, Instagram, Facebook groupchats every notification a reminder that rumours of you being a closeted racist spread. As you lay in bed crying all you can tell yourself is that your life at Stanford is over, you just got an email about being immediately terminated from the WiCS organization and you need to get out of here, there’s no way you can stay here anymore… You'll never be able to find a job… You can transfer to another school and just start anew…\n\n<1>One Year Later</1>",
    "6b1-1": "You are now a senior CS student at UC berkeley and have only just begun adjusting to your new life… You miss Anne, your swimming teammates and Stanford, but there is just too much baggage in the past and you want to start anew. You are seeing a therapist, you’ve developed OCD and anxiety over the past year, as you have trouble not obsessively checking the internet to see where that dreaded screenshot has spread to next. People still look at you funny in public sometimes, and despite all the new social media accounts you've made, you still get harassed online over that message, as people online label you as a racist elitist.. You miss being involved in student activities, but can't bring yourself to socialize all that much anymore… You are more distant from your parents… They have not been supportive and they frequently bring up how you could have expressed such views, and how it makes you a bad person… You have a lot of trouble speaking with other men, online and in person, for fear the same thing could happen again…\n\n<strong>Epilogue</strong>\n\nLife is going good for Matthew, as he is now a senior executive of security and trust at Facebook. Matthew continues to abuse his access to internal data at Facebook to get detailed information about a woman’s personality and interests so he can charm them on first dates, and uses this data to harass and stalk them if they don't pursue the relationship further…  Indeed, Matthew used his data access rights to modify the message Sydney sent him, access Syndney’s account and send it to Rachel so it looked like she sent the message…",
    "6b2": "You decide that you have to turn to your friends and family for support. Maybe if they understood the situation they could help you get out of this mess. \n\nYou begin explaining to Anne the whole ordeal, how your date with Matthew was alright, you didn't feel much and he responded nastily so you just decided to send him a stern message. You show Anne the horrible text he sent you… Anne’s face looks very distraught, and she comforts you as your hands begin to shake and your voice trembles as you get near the end of the story. Anne assures you that she knows the message is fake,  that you would never say anything like that to Rachel and that she believes everything. You feel a bit better, but still what could you possibly do? The screenshot is surely everywhere by now… Anne assures you that she will back you up, and that you should simply be honest with everyone about what happened. She assures you that people will believe you, you have the nasty message from Matthew to support your case after all. You decide the best course of action is to write some sort of statement, explaining the situation with screenshots of Matthew’s nasty message and send it to everyone, your parents, the WiCS group, the swimming team, and maybe post it to social media. \n\nSo you take some time to write a nice statement. It’s almost painful to recollect all this and you can't help feeling some shame and self guilt. You should have never gone on that date, you should never have responded to him, hell maybe even gone on a second date. Anne assures you it's outrageous for you to be blaming yourself and none of this is your fault… You still can't shake the feeling that it somehow is though. \n\nAfter re-reading your statement over and over and over again, and appealing for the support of your closest friends and family, you decide to finally release the statement. As you hit post and send across multiple mediums you can bear to look at your phone or computer anymore, you just need to sleep… You go to sleep feeling incredibly worn out, and you can't get the situation out of your head and you begin to spiral. You feel like your career prospects and reputation are just irreparably destroyed.\n\nThe next morning, you gingerly check your phone social media for the response… To your surprise almost all your friends and family are supportive and in shock that this happened, and you feel some of the tension that has soaked your whole body for the past 24 hours finally dissipate… Your heart sinks at the one or two comments from anonymous accounts that give you every misogynistic slur in the book, exclaiming that you’re just another woman who’s been exposed and now crying about it… Anne assures you to just block them, and that you’ll get through this, most people believe you… but that screenshot is still out there… and you can't help but feel that this is going to haunt you forever.\n\n<1>One Year Later</1>",
    "6b2-1": "You are now a senior at Stanford and decided not to run again for president of WiCS again, you tried to, but the past incident just made it impossible… There’s still a group of people that think deep down you’re very racist and you have stopped swimming. You have grown to become really anxious whenever a guy asks you out on a date and you see a therapist once a week for the panic attacks you have sometimes when you surf the web and see mentions of the whole incident, and although no one really talks about the incident anymore, it comes up every now and then from anonymous people online and you have no idea how to cope with it. Seeing the screenshot re-opens old wounds you thought have healed and gone away. While most of your friends and family have been supportive and there for you and encourage you to get involved again, you find your mood is very unstable and you are very depressed some days and it even gets in the way of school sometimes. “Maybe swimming again will take your mind off the incident” they say… You appreciate their support, but deep down even a year later, you find yourself just stuck in a thought pattern thinking about the incident, and regretting ever going on a date with Matthew and you still wonder how he ever managed to make it look like you sent that horrible message to Rachel. Maybe he hacked your Facebook? Who knows…\n\n<strong>Epilogue</strong>\n\nMatthew is still an engineer at Facebook. He continues to abuse his data access rights to stalk and learn about the women he goes on dates with, and uses it to harass the women if they don't agree to a second date. Surely enough, Matthew was able to use his access rights to access Sydney’s account and make it look like she sent that horrible racist message to Rachel… He knows that if he gets caught he will be fired and was surprised to see that Sydney didn't accuse him publicly of anything, so he decides to reel back on abusing his data access rights for the time being… Maybe he’ll give it a couple of months before he tries it again…",
    "6b3": "You feel increasing anger and shame and decide that what just happened to you must be illegal. Surely, this is some sort of defamation and you should be able to take some sort of legal action against Matthew. Isn’t this libel or something? You’re not a lawyer and you’re not sure what law is exactly being broken here but it just has to be violating some law, otherwise you have lost all faith in this country. You yell at Anne to get out and decide to do some internet lawyer investigative work.\n\nYou quickly run into roadblocks, you have no idea what a tort is, let alone the difference between libel per se and libel per quod in the state of California. You quickly lose confidence. You dont know a thing about the legal system… How in the world do you even begin to raise a defamation case? You begin to feel overwhelmed and tell Anne about your predicament. You're not even sure if it is worth raising a legal case anymore, the whole process from your research seems long, hard to prove and inaccessible. Maybe you should just confront Matthew, maybe threaten him with legal action, and get him to admit to everyone that he was lying… That could backfire though… Anne suggests that you just lawyer up, you never know what Matthew could do if you confronted him, maybe he’ll make it even worse.\n\n<2>Agree with Anne, you should just commit to the legal route.</2>\n\n<3>Confront Matthew, maybe this can be resolved privately</3>",
    "6b3-selected-a": "\n\n<0>Take it to the police</0>",
    "6b3-selected-b": "\n\n<0>Message matthew</0>",
    "7b3a": "You agree with Anne that pursuing legal action is the best course of action here. Afterall, your reputation has been destroyed because of this, but how do you prove that Matthew was behind all this? It seems almost impossible, all you have is that coincidentally the message you sent him yesterday at lunch, and the racist one that it appears you sent Rachel are very similar? Maybe this will cast enough suspicion on Matthew? You immediately take screenshots of your messages with Matthew and start doing research on legal aid and criminal lawyers in your area. You find a criminal lawyer named Mark who will give you a 1 hour consultation. You call him and explain your case. Your heart sinks as he expresses doubt that you can actually prove that it was Matthew behind this message, you would somehow have to prove that it was him who got into your Facebook account and sent that message with the intent of defaming you. He says it’s tough to prove, but not inconceivable. You leave the call feeling sort of defeated and unsure of how the case will progress…\n\n<1>Eight Months Later</1>",
    "7b3a-1": "It has taken 8 whole months for your case to go to trial, and the process has been exhausting. You have had to spend countless hours talking to your lawyer about the particulars of the case, and have had to endure hours of conversation with Mark involving legalese that goes over your head. The whole process has been long, exhausting, expensive and has certainly taken a toll on your academic performance. This case feels like an extra weight on your shoulders for the past 8 months and your friends frequently remind you that you’re just not the same. Thankfully most, but not all of your peers have been supportive otherwise, and you just want the case to be decided so you can get some closure about the whole incident. You have stepped down from your position as co-president of WiCS and you don't swim anymore. You still get weird looks around campus these days, and worse of all, you still get accused of being racist now and then, and it has taken a toll on your social life, some former friends at WiCS refuse to talk to you, least of all Rachel. \n\n<strong>Epilogue</strong>\n\nIn the end, Matthew is found guilty of libel under California law, and was fired from his job at Facebook. Surprisingly, after much investigation the combination of the message it appears you sent Rachel being very similar to the one you sent Matthew, and Matthew actually being the recipient of similar accusations in the past from other women was enough for Facebook to audit his data access history, and it turns out that Matthew has a history of abusing his data access rights with countless women, and actually hacked into Sydney’s account and sent that racist message. The aftermath is a relief, and you slowly get some of your friends back… You find yourself horrified that Facebook engineers have this sort of data access, and you find yourself not wanting to work there as you wonder how many other women this has happened to…",
    "7b3b": "You decide that the monstrous legal system is not worth diving into, afterall you’re a poor student and you likely can’t afford a lawyer anyways. You decide instead to message Matthew on Facebook and threaten him with legal action if he doesn’t clear your name.\n\nText Message: Matthew, I know you’re the one behind that nasty racist message to Rachel. I don't know how you made it look like it was sent from my account but I know you had something to do with it. It was worded almost exactly the same as the message I sent you yesterday at lunch, just with a few nasty changes. I’m giving you the chance right now to admit to me and all my friends that you’re the one who did this, if not I will pursue legal action against you.\n\nYou hit send and compulsively check your phone for the next few hours, which feels like days. No response.  You actually realize that Matthew has now blocked you from Facebook and oddly, all the messages between you on Facebook messenger are gone. “Screw it” you say to yourself and you call a lawyer named Mark and explain the situation to him. Your lawyer believes you have reasonable grounds for raising defamation charges, as long as you have some way of proving that it was actually Matthew who was behind the dissemination of that message. You quickly rack your brain of how you could possibly prove this now that the messenger messages are gone. You quickly remember you have text messages on your phone, all you have is the first nasty message he sent you, and your response. Damn! You would have had more proof if you still had your messages you exchanged on Facebook you could argue that he sent you that message first, so he must have created it. You tell all this to your lawyer, who reluctantly tells you that without more convincing evidence to prove it, you likely wouldn't win a case in court and that was that. You leave the call feeling heartbroken. How will you get all your friends back?  You begin to spiral again as you rack your brain for ideas, but you can’t think of anything. You dont know how you will move past this. Maybe you’ll move away, or just plead the truth to Rachel and the girls at WiCS but you find the mere prospect of facing them extremely daunting. Meanwhile you wonder how Matthew could have possibly gotten into your Facebook account…\n\n<strong>Epilogue</strong>\n\nMatthew is still an engineer at Facebook. He continues to abuse his data access rights to stalk and learn about the women he goes on dates with, and uses it to harass the women if they don't agree to a second date. Surely enough, Matthew was able to use his access rights to break into Sydney's Facebook account and make it look like she was the one who sent that nasty racist message to Rachel. He knows that if he gets caught he will be fired and was spooked after being contacted by the police. Thankfully, using his data access rights, he erased all correspondence between him and Sydney on Facebook by the time Sydney wanted to hand them over to her lawyer, so they have no way to prove it was him who created the defaming message. All they had was a few nasty exchanges over text messages. No biggie. Matthew decides to lay back on his data abuses for now, as being threatened by a lawsuit was a bit of a sobering reality check… Yet he plans to continue in the not so distant future.",
    "start": "Welcome! \n \nTech Dating Simulator is a text based choose your own adventure game to highlight some of the plights women could conceivably face in the future when it comes to dating in a tech filled world. This is known as Technology-Facilitated Gender Based Violence.\n \n The goal of the game is to bring light to some of the ways in which technology is enabling novel forms of partner related/gender violence and the legal, emotional, and social challenges women must face to deal with these issues. Many of the scenarios and premises of this game deal with real world stories and real-world laws and we hope for this game to be informative about some of the challenges women face today and the conceivable challenges they may continue to face.\n \n <strong>CONTENT WARNING:</strong> Some of the scenarios described in this game may be upsetting, or perhaps triggering for victims of gender based and partner violence. \n \n <0>Start</0>"
}